{"timestamp":1754341563092,"data":{"stats":{"citations":59,"hIndex":3,"i10Index":1},"publications":[{"title":"Flexible domain prediction using mixed effects random forests","authors":"P Krennmair, T Schmid","venue":"Journal of the Royal Statistical Society Series C: Applied Statistics 71 (5 …, 2022","citedBy":45,"year":"2022","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:zYLM7Y9cAGgC","directUrl":"https://academic.oup.com/jrsssc/article-abstract/71/5/1865/7073307","abstract":"This paper promotes the use of random forests as versatile tools for estimating spatially disaggregated indicators in the presence of small area-specific sample sizes. Small area estimators are predominantly conceptualised within the regression-setting and rely on linear mixed models to account for the hierarchical structure of the survey data. In contrast, machine learning methods offer non-linear and non-parametric alternatives, combining excellent predictive performance and a reduced risk of model-misspecification. Mixed effects random forests combine advantages of regression forests with the ability to model hierarchical dependencies. This paper provides a coherent framework based on mixed effects random forests for estimating small area averages and proposes a non-parametric bootstrap estimator for assessing the uncertainty of the estimates. We illustrate advantages of our proposed methodology …"},{"title":"Analysing opportunity cost of care work using mixed effects random forests under aggregated census data","authors":"P Krennmair, N Würz, T Schmid","venue":"arXiv preprint arXiv:2204.10736, 2022","citedBy":6,"year":"2022","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:YsMSGLbcyi4C","directUrl":"https://arxiv.org/abs/2204.10736","abstract":"Reliable estimators of the spatial distribution of socio-economic indicators are essential for evidence-based policy-making. As sample sizes are small for highly disaggregated domains, the accuracy of the direct estimates is reduced. To overcome this problem small area estimation approaches are promising. In this work we propose a small area methodology using machine learning methods. The semi-parametric framework of mixed effects random forest combines the advantages of random forests (robustness against outliers and implicit model-selection) with the ability to model hierarchical dependencies. Existing random forest-based methods require access to auxiliary information on population-level. We present a methodology that deals with the lack of population micro-data. Our strategy adaptively incorporates aggregated auxiliary information through calibration-weights - based on empirical likelihood - for the estimation of area-level means. In addition to our point estimator, we provide a non-parametric bootstrap estimator measuring its uncertainty. The performance of the proposed point estimator and its uncertainty measure is studied in model-based simulations. Finally, the proposed methodology is applied to the  Socio-Economic Panel and aggregate census information from the same year to estimate the average opportunity cost of care work for  regional planning regions in Germany."},{"title":"Tree-based machine learning in small area estimation","authors":"P Krennmair, N Wurz, T Schmid","venue":"The Survey Statistician 86, 22-31, 2022","citedBy":5,"year":"2022","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:2osOgNQ5qMEC","directUrl":"https://isi-iass.org/home/wp-content/uploads/Survey_Statistician_2022_July_N86_03.pdf","abstract":"Reliable estimators of the spatial distribution of socio-economic indicators are essential for evidencebased policy-making. As the accuracy of direct estimates from survey data decrease with spatially finer target levels, small area estimation approaches are promising. In this article, we outline new approaches that combine small area methodology with machine learning methods. The presented semi-parametric approach is promising as it avoids the assumptions of linear mixed models in contrast to classical small area models and builds on random forests. These tree-based machine learning predictors have the advantage of robustness against outliers and implicit model-selection. As for classical small area models, we account for hierarchically dependent data. We present point estimators applicable to full as well as aggregated auxiliary data access and outline their uncertainty measure. We compare methods based on a reproducible and illustrative example using open-source income data from Austria."},{"title":"The R package SAEforest","authors":"P Krennmair, MP Krennmair","venue":"R package version 1 (0), 2022","citedBy":3,"year":"2022","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:qjMakFHDy7sC","directUrl":"https://scholar.google.com/scholar?cluster=2878345035015286887&hl=en&oi=scholarr","abstract":"Description Mixed Effects Random Forests (MERFs) are a data-driven, nonparametric alternative to current methods of Small Area Estimation (SAE).'SAEforest'provides functions for the estimation of regionally disaggregated linear and nonlinear indicators using survey sample data. Included procedures facilitate the estimation of domain-level economic and inequality metrics and assess associated uncertainty. Emphasis lies on straightforward interpretation and visualization of results. From a methodological perspective, the package builds on approaches discussed in Krennmair and Schmid (2022)< arXiv: 2201.10933 v2> and Krennmair et al.(2022)< arXiv: 2204.10736>."},{"title":"Analysing opportunity cost of care work using mixed effects random forests under aggregated auxiliary data","authors":"P Krennmair, N Würz, T Schmid","venue":"Journal of the Royal Statistical Society Series C: Applied Statistics, qlaf031, 2025","citedBy":0,"year":"2025","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:IjCSPb-OGe4C","directUrl":"https://academic.oup.com/jrsssc/advance-article-abstract/doi/10.1093/jrsssc/qlaf031/8125133","abstract":"Evidence-based policy-making requires reliable, spatially disaggregated indicators. The framework of mixed effects random forests leverages the advantages of random forests and hierarchical data in small area estimation. These methods require typically access to auxiliary information on population level, which is a strong limitation for practitioners. In contrast, our proposed method—for point and uncertainty estimation—abstains from access to unit-level population data but adaptively incorporates aggregated auxiliary information through calibration weights. We demonstrate its usage for estimating opportunity cost of care work for Germany from the Socio-Economic Panel and census aggregates. Simulation studies evaluate our proposed method."},{"title":"A Framework for the Estimation of Disaggregated Statistical Indicators Using Tree-Based Machine Learning Methods","authors":"P Krennmair","venue":"","citedBy":0,"year":"2023","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:W7OEmFMy1HYC","directUrl":"https://refubium.fu-berlin.de/handle/fub188/37542","abstract":"The thesis combines four papers that introduce a coherent framework based on MERFs for the estimation of spatially disaggregated economic and inequality indicators and associated uncertainties. Chapter 1 focusses on flexible domain prediction using MERFs. We discuss characteristics of semi-parametric point and uncertainty estimates for domain-specific means. Extensive model- and design-based simulations highlight advantages of MERFs in comparison to 'traditional' LMM-based SAE methods. Chapter 2 introduces the use of MERFs under limited covariate information. The access to population-level micro-data for auxiliary information imposes barriers for researchers and practitioners. We introduce an approach that adaptively incorporates aggregated auxiliary information using calibration-weights in the absence of unit-level auxiliary data. We apply the proposed method to German survey data and use aggregated covariate census information from the same year to estimate the average opportunity cost of care work for 96 planning regions in Germany. In Chapter 3, we discuss the estimation of non-linear poverty and inequality indicators. Our proposed method allows to estimate domain-specific cumulative distribution functions from which desired (non-linear) poverty estimators can be obtained. We evaluate proposed point and uncertainty estimators in a design-based simulation and focus on a case study uncovering spatial patterns of poverty for the Mexican state of Veracruz. Additionally, Chapter 3 informs a methodological discussion on differences and advantages between the use of predictive algorithms and (linear) statistical models …"},{"title":"Flexible domain prediction using mixed effects random forests","authors":"T Schmid, P Krennmair","venue":"Otto-Friedrich-Universität 71 (5), 2022","citedBy":0,"year":"2022","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:Y0pCki6q_DkC","directUrl":"https://fis.uni-bamberg.de/entities/publication/a47ae966-2a4c-460a-adbd-99c8444a6324","abstract":"This paper promotes the use of random forests as versatile tools for estimating spatially disaggregated indicators in the presence of small area-specific sample sizes. Small area estimators are predominantly conceptualised within the regression-setting and rely on linear mixed models to account for the hierarchical structure of the survey data. In contrast, machine learning methods offer non-linear and non-parametric alternatives, combining excellent predictive performance and a reduced risk of model-misspecification. Mixed effects random forests combine advantages of regression forests with the ability to model hierarchical dependencies. This paper provides a coherent framework based on mixed effects random forests for estimating small area averages and proposes a non-parametric bootstrap estimator for assessing the uncertainty of the estimates. We illustrate advantages of our proposed methodology using Mexican income-data from the state Nuevo León. Finally, the methodology is evaluated in model-based and design-based simulations comparing the proposed methodology to traditional regression-based approaches for estimating small area averages."},{"title":"Die Macht der Schulden: Interdisziplinäre Perspektiven auf die sozioökonomischen Implikationen von Staatsverschuldung im Kontext der Sustainable Development Goals","authors":"M Thalhammer, P Krennmair","venue":"Shrinking Spaces: Mehr Raum für globale Zivilgesellschaft, 171-208, 2020","citedBy":0,"year":"2020","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:Tyk-4Ss8FVUC","directUrl":"https://ucrisportal.univie.ac.at/en/publications/die-macht-der-schulden-interdisziplin%C3%A4re-perspektiven-auf-die-soz","abstract":"Die Macht der Schulden: Interdisziplinäre Perspektiven auf die sozioökonomischen Implikationen \nvon Staatsverschuldung im Kontext der Sustainable Development Goals — University of \nVienna Skip to main navigation Skip to search Skip to main content University of Vienna \nHome University of Vienna Logo u:cris Info Deutsch English Home Persons Units and bodies \nProjects Publications Activities Prizes Press/Media Search by expertise, name or affiliation Die \nMacht der Schulden: Interdisziplinäre Perspektiven auf die sozioökonomischen Implikationen \nvon Staatsverschuldung im Kontext der Sustainable Development Goals Martin Thalhammer, \nPatrick Krennmair StudiesServiceCenter Social Sciences Vienna Center for Experimental \nEconomics Publications: Contribution to book › Chapter Overview Original language \nGerman Title of host publication Shrinking Spaces Subtitle of host publication Mehr Raum für …"},{"title":"Die Macht der Schulden: Interdisziplinäre Perspektiven auf die sozioökonomischen Implikationen von Staatsverschuldung im Kontext der Sustainable Development Goals","authors":"P Krennmair, M Thalhammer","venue":"","citedBy":0,"year":"","publicationUrl":"https://scholar.google.com/citations?view_op=view_citation&hl=de&user=1NgPLREAAAAJ&citation_for_view=1NgPLREAAAAJ:UeHWp8X0CEIC","directUrl":"https://www.researchgate.net/profile/Martin-Thalhammer/publication/351461029_Die_Macht_der_Schulden_Interdisziplinare_Perspektiven_auf_die_soziookonomischen_Implikationen_von_Staatsverschuldung_im_Kontext_der_Sustainable_Development_Goals/links/60996d7592851c490fce91f0/Die-Macht-der-Schulden-Interdisziplinaere-Perspektiven-auf-die-soziooekonomischen-Implikationen-von-Staatsverschuldung-im-Kontext-der-Sustainable-Development-Goals.pdf","abstract":"The achievement of the United Nations Sustainable Development Goals depends not least on the burden of debt borne by each country. In the 2030 Agenda the subject of „debt “is barely mentioned, but for many countries of the Global South it represents an oppressive reality. This article takes the form of a historical, cultural and socio-anthropological analysis illustrating that the moral norm that debts are to be repaid as quickly as possible is relatively new in the history of the human race, and sees the root of the problem of debt in (neo-) colonialism, which placed many countries under a heavy burden of debt. Haiti, for instance, which today is one of the poorest countries on the American continent, had to pay an enormous „independence debt “for its independence from France in 1804, the consequences of which it is still experiencing even today. Structural Adjustment Programs represent a heavy burden for countries which are compelled to submit to neoliberal political and economic programmes in exchange for loans. This paper proposes as a solution a state insolvency process to be carried out on an internationally regulated legal basis."}]}}